---
kind: method
id: M:Autodesk.Revit.DB.BoundingBoxUV.#ctor(System.Double,System.Double,System.Double,System.Double)
source: html/856cfc83-d01d-195a-7592-46682698a373.htm
---
# Autodesk.Revit.DB.BoundingBoxUV.#ctor Method

Creates object with supplied values.

## Syntax (C#)
```csharp
public BoundingBoxUV(
	double min_u,
	double min_v,
	double max_u,
	double max_v
)
```

## Parameters
- **min_u** (`System.Double`) - The first coordinate of min.
- **min_v** (`System.Double`) - The second coordinate of min.
- **max_u** (`System.Double`) - The first coordinate of max.
- **max_v** (`System.Double`) - The second coordinate of max.